{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"dense_26_input": {"name": "dense_26_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8001"}, {"size": "4"}]}}}, "outputs": {"activation_29": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "88"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/max_pooling1d_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/flatten_5/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_29/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40010"}, {"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_29/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "88"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_26_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8001"}, {"size": "4"}]}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Shape", "op": "Shape", "input": ["dense_26_input"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Shape", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/axes", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Shape", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/free", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2_1", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const_2", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Prod", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Reshape", "op": "Reshape", "input": ["dense_26_input", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Reshape", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot/MatMul", "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_7/dense_26/Tensordot", "StatefulPartitionedCall/sequential_7/dense_26/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/activation_26/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_7/dense_26/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/activation_26/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Shape", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/axes", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Shape", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/free", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2_1", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const_2", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Prod", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/activation_26/Relu", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Reshape", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot/MatMul", "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_7/dense_27/Tensordot", "StatefulPartitionedCall/sequential_7/dense_27/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/activation_27/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_7/dense_27/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/max_pooling1d_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_7/activation_27/Relu", "StatefulPartitionedCall/sequential_7/max_pooling1d_1/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/max_pooling1d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_7/max_pooling1d_1/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/max_pooling1d_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_7/max_pooling1d_1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/max_pooling1d_1/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Shape", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/axes", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Shape", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/free", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2_1", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const_2", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Prod", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/max_pooling1d_1/Squeeze", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Reshape", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot/MatMul", "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential_7/dense_28/Tensordot", "StatefulPartitionedCall/sequential_7/dense_28/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_7/activation_28/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_7/dense_28/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/flatten_5/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_7/activation_28/Relu", "StatefulPartitionedCall/sequential_7/flatten_5/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_29/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/flatten_5/Reshape", "StatefulPartitionedCall/sequential_7/dense_29/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_29/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_7/activation_29/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_7/dense_29/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7/activation_29/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/ReadVariableOp", "shape": [20, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/ReadVariableOp", "shape": [10, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/ReadVariableOp", "shape": [4, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_26/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_27/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/max_pooling1d_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_28/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/flatten_5/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_29/MatMul/ReadVariableOp", "shape": [40010, 88], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_29/BiasAdd/ReadVariableOp", "shape": [88], "dtype": "float32"}]}]}